# 3.2. Multiple variables stored in one column - tb

In [1]:
options(stringsAsFactors = FALSE)
library(reshape2)
library(plyr)
library(stringr)

# Load -----------------------------------------------------------------------
raw <- read.csv("../../data/tb.csv", na.strings = "")
raw$new_sp <- NULL
raw <- subset(raw, year == 2000)
names(raw)[1] <- "country"

names(raw) <- str_replace(names(raw), "new_sp_", "")
raw$m04 <- NULL
raw$m514 <- NULL
raw$f04 <- NULL
raw$f514 <- NULL

In [2]:
dim(raw)
head(raw)

[1] 201  18

    country year m014 m1524 m2534 m3544 m4554 m5564 m65 mu f014 f1524 f2534
11  AD      2000  0     0     1     0     0    0     0  NA NA    NA    NA
37  AE      2000  2     4     4     6     5   12    10  NA  3    16     1
61  AF      2000 52   228   183   149   129   94    80  NA 93   414   565
88  AG      2000  0     0     0     0     0    0     1  NA  1     1     1
137 AL      2000  2    19    21    14    24   19    16  NA  3    11    10
166 AM      2000  2   152   130   131    63   26    21  NA  1    24    27
    f3544 f4554 f5564 f65 fu
11   NA    NA   NA    NA  NA
37    3     0    0     4  NA
61  339   205   99    36  NA
88    0     0    0     0  NA
137   8     8    5    11  NA
166  24     8    8     4  NA

In [3]:
# Melt -----------------------------------------------------------------------

clean <- melt(raw, id = c("country", "year"), na.rm = TRUE)
names(clean)[3] <- "column"
names(clean)[4] <- "cases"

clean <- arrange(clean, country, column, year)

In [4]:
dim(clean)
head(clean)

[1] 2273    4

  country year column cases
1 AD      2000 m014   0
2 AD      2000 m1524  0
3 AD      2000 m2534  1
4 AD      2000 m3544  0
5 AD      2000 m4554  0
6 AD      2000 m5564  0

In [5]:
# Break up variable in to sex and age ----------------------------------------

clean$sex <- str_sub(clean$column, 1, 1)

ages <- c("04" = "0-4", "514" = "5-14", "014" = "0-14", "1524" = "15-24", "2534" = "25-34", "3544" = "35-44", "4554" = "45-54", "5564" = "55-64", "65"= "65+", "u" = NA)

clean$age <- factor(ages[str_sub(clean$column, 2)], levels = ages)

clean <- clean[c("country", "year", "sex", "age", "cases")]

clean[1:15, ]

   country year sex age   cases
1  AD      2000 m   0-14   0
2  AD      2000 m   15-24  0
3  AD      2000 m   25-34  1
4  AD      2000 m   35-44  0
5  AD      2000 m   45-54  0
6  AD      2000 m   55-64  0
7  AD      2000 m   65+    0
8  AE      2000 m   0-14   2
9  AE      2000 m   15-24  4
10 AE      2000 m   25-34  4
11 AE      2000 m   35-44  6
12 AE      2000 m   45-54  5
13 AE      2000 m   55-64 12
14 AE      2000 m   65+   10
15 AE      2000 f   0-14   3